---
kind: other
id: Properties.T:Autodesk.Revit.DB.HasNoValueFilterRule
source: html/fd3de289-6d5f-f0df-7a02-da89071e2a10.htm
---
# HasNoValueFilterRule Properties

Specifies whether the .NET object represents a valid Revit entity.